
import { Theme } from './types';

export const THEMES: Theme[] = [
  {
    title: '動物',
    words: [
      'いぬ', 'ウサギ', 'カエル', 'カバ', 'カンガルー', 'キリン', 'クジャク', 'クマ', 'ゴリラ', 'サル', 
      'ゾウ', 'トナカイ', 'ニワトリ', 'ねこ', 'ハト', 'ハリネズミ', 'パンダ', 'ヒツジ', 'ブタ', 'ヘビ', 
      'ペンギン', 'ライオン', 'ラクダ', 'ラッコ', 'レッサーパンダ'
    ]
  },
  {
    title: 'スポーツ',
    words: [
      'アイスホッケー', 'ゲートボール', 'ゴルフ', 'サーフィン', 'サイクリング', 'サッカー', 'スキー', 
      'スノーボード', 'ソフトボール', 'ダーツ', 'ダンス', 'テニス', 'ドッジボール', 'バスケットボール', 
      'バドミントン', 'バレーボール', 'ビリヤード', 'フィギュアスケート', 'フェンシング', 'ボウリング', 
      'ボクシング', 'ムエタイ', 'ヨガ', 'ラグビー', 'ラジオ体操', 'ランニング', 'レスリング', '空手', 
      '剣道', '柔道', '水泳', '相撲', '卓球', '野球'
    ]
  },
  {
    title: '職業',
    words: [
      'アイドル', 'アパレル店員', 'インフルエンサー', 'オーケストラ指揮者', 'お医者さん', 'お笑い芸人', 
      'カウンセラー', 'グラフィックデザイナー', 'ゲームデザイナー', 'サラリーマン', 'シェフ', 'シンガー', 
      'ダイエットコーチ', 'ドライバー', 'バーテンダー', 'パイロット', 'バンドマン', 'ファッションスタイリスト', 
      'フォトグラファー', 'フリーター', 'プロゲーマー', '宇宙飛行士', '映画監督', '園芸家', '介護士', 
      '看護師', '漁師', '学校の先生', '銀行員', '警察官', '作家', '歯医者さん', '車掌さん', 
      '寿司職人', '獣医師', '消防士', '政治家', '大工', '美容師', '弁護士', '保育士', '薬剤師'
    ]
  },
  {
    title: '日常の動作',
    words: [
      'お化粧', 'お風呂', 'カーテンをあける', 'サランラップ', '顔を洗う', '散髪', '歯磨き', '車の運転', 
      '食器洗い', '寝る', '洗濯', '掃除', '電話', '買い物', '髭剃り', '料理'
    ]
  },
  {
    title: '場所・建物',
    words: [
      'お化け屋敷', 'お寺', 'お城', 'コンビニ', 'スカイツリー', 'ディズニーランド', 'ビーチ', 'ピサの斜塔', 
      'ピラミッド', 'ファミレス', 'ユニバーサルスタジオジャパン', '沖縄', '自由の女神', '神社', '水族館', 
      '東京ドーム', '動物園', '富士山', '北海道', '万里の長城'
    ]
  },
  {
    title: '有名人・スポーツ選手',
    words: [
      'AKB48', 'アントニオ猪木', 'イチロー', 'マツコデラックス', '橋本環奈', '錦戸亮', '錦織圭', '桑田佳祐', 
      '五木ひろし', '広瀬すず', '黒柳徹子', '坂上忍', '松岡修造', '新垣結衣', '石原さとみ', '浅田真央', 
      '大谷翔平', '中居正広', '乃木坂46', '浜崎あゆみ', '北川景子', '木村拓哉', '有村架純', '櫻井翔'
    ]
  },
  {
    title: 'お笑い芸人',
    words: [
      'エドはるみ（グーググーグー）', 'オードリー（トゥース！）', 'おばたのお兄さん（まーきのっ）', 
      'クールポコ（やっちまったなぁ）', 'コウメ太夫（チッキショー）', 'サンシャイン池崎（イェェェェーイ）', 
      'ジャングルポケット（ハァーイッ）', 'ジョイマン（ナナナナー）', 'ダチョウ倶楽部', 'タモリ', 
      'ダンディ坂野（ゲッツ）', 'チョコレートプラネット（T,T,TTTT）', 'ティモンディ（やればできる）', 
      'ですよ。（あーい、とぅいまてーん）', 'テツandトモ（なんでだろう）', 'とにかく明るい安村（安心して下さい、履いてますよ）', 
      'トム・ブラウン（ダメー）', 'トレンディエンジェル（斎藤さんだぞ）', 'なかやまきんに君（パワー）', 'ビートたけし', 
      'ひょっこりはん（はい、ひょっこりはん）', 'ぺこぱ（時を戻そう）', 'ぼる塾（まぁ～ねぇ～）', 
      'ゆりやんレトリィバァ（調子乗っちゃって）', 'レイザーラモンHG（フォー）', '永野（ラッセンが好き）', 
      '錦鯉（こぉーんにちわー）', '志村けん', '小島よしお（そんなの関係ねぇ）', '霜降り明星せいや（せっせせいや）', 
      '霜降り明星そしな（野党ッ）', '髭男爵（ルネッサーンス）'
    ]
  }
];
